#+TITLE: Week 4.21 Math Homework
#+AUTHOR: 2024110144 陈有骏
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,10pt]
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LATEX_HEADER: \usepackage{xeCJK}
#+OPTIONS: \n:t toc:nil num:nil date:nil

#+begin_comment
4.21
Thomas 13.1 1-40 mod 5
left: 5(need manual drawing after print)
4.23
Thomas 13.6 1-16 mod 4
left: nil
4.25
Thomas 13.3 1-22 mod 4
left: nil
#+end_comment

** 12
#+begin_src scheme :exports both
  (define T1 84)
  (define T0 1.881)
  (define A0 22.78)
  (define calc-a
    (lambda (a0 t0 t1)
      (let ((c (/ (* a0 a0 a0) (* t0 t0))))
	(expt (* c (* t1 t1)) 1/3))))
  (calc-a A0 T0 T1)
#+end_src

#+RESULTS:
: 286.73500366130844

so about $3\times 10^{12}$ meter

** 16
#+begin_src scheme :exports both
  (define p 2360550)
  (expt (/ (* 6.674 5.972 (* p p) (expt 10 13)) (* 4 3.1415926 3.1415926)) 1/3)
#+end_src

#+RESULTS:
: 383169467.76859224

so it is about $3.8\times 10^8$ meter

